export const userMessages = {
  noRoomBot: '❌ خطأ في ترتيب الخطوات: يجب تعيين حساب الغرفة أولاً!\nيرجى استخدام أمر \'حساب رومات\' أولاً.',
  invalidCommand: '❌ أمر غير صالح. يرجى التحقق من الأمر وإعادة المحاولة.',
  sendNextMessage: '📩 أرسل الرسالة التالية...',
  sendNextRoomABotToken: '📩 أرسل توكين حساب الغرفة التالي...',
  pleaseWait: '⏳ يرجى الانتظار...',
  adsNotRunning: '❌ لا توجد إعلانات قيد التشغيل حاليًا.',
  stateCleared: `تم إيقاف البوت بنجاح.
تم الاحتفاظ بنمط الإعلان ورسائل الإعلان، وتم تصفير عدد الإعلانات المرسلة.
يرجى الانتظار لمدة دقيقة قبل إعادة استخدام حسابات الرومات أو الإعلانات.
سيقوم البوت بإشعارك عندما يمكنك البدء من حساب الرومات الأول.`,
  stateReset: `تم إعادة تعيين البوت بنجاح.
يرجى الانتظار لمدة دقيقة وعدم إرسال حساب رومات الآن.
سيقوم البوت بإشعارك عندما يمكنك إرسال أمر حساب الرومات.`,
  roomConnectionCooldownStarted: `يرجى الانتظار لمدة دقيقة قبل محاولة اتصال حساب الرومات مرة أخرى.
سيقوم البوت بإشعارك عندما يمكنك إرسال أمر حساب الرومات.`,
  preparationConnectionCooldownStarted: `يرجى الانتظار لمدة دقيقة قبل إرسال أمر تجهيز مرة أخرى.
سيقوم البوت بإشعارك عندما يمكنك إعادة إرسال أمر تجهيز.`,
  roomConnectionCooldownWarning: seconds => `لا يمكن اتصال حساب رومات الآن.
يرجى الانتظار ${seconds} ثانية حتى انتهاء فترة الانتظار.
سيقوم البوت بإشعارك عندما يمكنك إرسال الأمر.`,
  roomConnectionCooldownComplete: `انتهت فترة الانتظار ويمكنك الآن إرسال أمر حساب الرومات:
حساب رومات
WE-AAAAAAAA`,
  preparationConnectionCooldownComplete: `انتهت فترة الانتظار ويمكنك الآن إعادة إرسال أمر:
تجهيز`,
  adConnectionCooldownStarted: `تم إغلاق جميع حسابات الإعلانات بسبب فشل الاتصال.
يرجى الانتظار لمدة دقيقة قبل محاولة الاتصال مرة أخرى.
سيقوم البوت بإشعارك عندما يمكنك إرسال حساب الإعلان الأول.`,
  adConnectionCooldownWarning: seconds => `لا يمكن اتصال حساب إعلان الآن.
يرجى الانتظار ${seconds} ثانية حتى انتهاء فترة الانتظار.
سيقوم البوت بإشعارك عندما يمكنك إرسال الأمر.`,
  adConnectionCooldownComplete: `انتهت فترة الانتظار ويمكنك الآن إرسال حساب الإعلان الأول:
حساب اعلان
WE-AAAAAAAA`,
  connectionBatchInProgress: 'توجد محاولة اتصال جارية حالياً، يرجى الانتظار حتى تنتهي.',
  campaignRestartCooldownStarted: `اكتملت الحملة وتم إغلاق الحسابات المتصلة.
يرجى الانتظار لمدة دقيقة قبل بدء حملة جديدة.
سيقوم البوت بإشعارك عندما يمكنك إرسال حساب الرومات الأول.`,
  skipMessageStep: `رساله الإعلان محفوظة مسبقا
  تم تخطي اختيار نمط الإعلان
  تم تخطي اضافة رسالة الإعلان`,
  botIsBusyResetting: `البوت مشغول حاليا بإيقاف العمليات الجارية وإعادة التعيين
  يرجى الانتظار`
};
