export const userMessages = {
  noRoomBot: '❌ خطأ في ترتيب الخطوات: يجب تعيين حساب الغرفة أولاً!\nيرجى استخدام أمر \'حساب رومات\' أولاً.',
  invalidCommand: '❌ أمر غير صالح. يرجى التحقق من الأمر وإعادة المحاولة.',
  sendNextMessage: '📩 أرسل الرسالة التالية...',
  sendNextRoomABotToken: '📩 أرسل توكين حساب الغرفة التالي...',
  pleaseWait: '⏳ يرجى الانتظار...',
  adsNotRunning: '❌ لا توجد إعلانات قيد التشغيل حاليًا.',
  stateCleared: 'تم إيقاف البوت بنجاح',
  stateReset: `تم إعادة تعيين البوت بنجاح.
يرجى الانتظار لمدة دقيقة وعدم إرسال حساب رومات الآن.
سيقوم البوت بإشعارك عندما يمكنك إرسال أمر حساب الرومات.`,
  roomConnectionCooldownStarted: `يرجى الانتظار لمدة دقيقة قبل محاولة اتصال حساب الرومات مرة أخرى.
سيقوم البوت بإشعارك عندما يمكنك إرسال أمر حساب الرومات.`,
  preparationConnectionCooldownStarted: `يرجى الانتظار لمدة دقيقة قبل إرسال أمر تجهيز مرة أخرى.
سيقوم البوت بإشعارك عندما يمكنك إعادة إرسال أمر تجهيز.`,
  roomConnectionCooldownWarning: seconds => `لا يمكن اتصال حساب رومات الآن.
يرجى الانتظار ${seconds} ثانية حتى انتهاء فترة الانتظار.
سيقوم البوت بإشعارك عندما يمكنك إرسال الأمر.`,
  roomConnectionCooldownComplete: `انتهت فترة الانتظار ويمكنك الآن إرسال أمر حساب الرومات:
حساب رومات
WE-AAAAAAAA`,
  preparationConnectionCooldownComplete: `انتهت فترة الانتظار ويمكنك الآن إعادة إرسال أمر:
تجهيز`,
  skipMessageStep: `رساله الإعلان محفوظة مسبقا
  تم تخطي اختيار نمط الإعلان
  تم تخطي اضافة رسالة الإعلان`,
  botIsBusyResetting: `البوت مشغول حاليا بإيقاف العمليات الجارية وإعادة التعيين
  يرجى الانتظار`
};
