export const userMessages = {
  noRoomBot: '❌ خطأ في ترتيب الخطوات: يجب تعيين حساب الغرفة أولاً!\nيرجى استخدام أمر \'حساب رومات\' أولاً.',
  invalidCommand: '❌ أمر غير صالح. يرجى التحقق من الأمر وإعادة المحاولة.',
  sendNextMessage: '📩 أرسل الرسالة التالية...',
  sendNextRoomABotToken: '📩 أرسل توكين حساب الغرفة التالي...',
  pleaseWait: '⏳ يرجى الانتظار...',
  adsNotRunning: '❌ لا توجد إعلانات قيد التشغيل حاليًا.',
  stateCleared: '✅ تم وقف الإعلانات واعادة تعيين البوت بنجاح.',
  stateReset: '✅ تم إعادة تعيين البوت بنجاح.'

};
